Autodesk.Revit.DB.CurveIntersectResultOption
Specifies how much information will be computed and returned when calculating intersection of Curves.
Since:
2026
Since:
2026

Autodesk.Revit.DB.CurveIntersectResultOption.Detailed
Return overlap points and intervals, in addition to the intersection's classification.
Note: selecting this option may cause additional calculations to be performed when determining the curve intersection.

Autodesk.Revit.DB.CurveIntersectResultOption.Simple
Only return the SetComparisonResult classifying the type of intersection (or lack thereof).